---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsStartHigherThanEnd
source: html/7e26aa9f-f064-f987-9c70-cd5cc3b1cbb9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsStartHigherThanEnd Property

The stairs' base (Base Level + Base Offset) must be below its top (Top Level + Top Offset).

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsStartHigherThanEnd { get; }
```